loboris/MicroPython_K210_LoBo/k210-freertos/mpy_support/mpconfigport.h
/*
 * This file is part of the MicroPython K210 project, https://github.com/loboris/MicroPython_K210_LoBo
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2019 LoBo (https://github.com/loboris)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#ifndef _MP_CONFIG_PORT_H_
#define _MP_CONFIG_PORT_H_

#include <sys/types.h>
#include <stdint.h>
#include <stddef.h>
#include <stdbool.h>
#include <limits.h>
// We need to provide a declaration/definition of alloca()
#include <alloca.h>
#include "FreeRTOSConfig.h"
#include "k210_config.h"

extern uint32_t _ram_start;
extern uint32_t _ram_end;


// Set this to 0 for normal build!
#define MICROPY_DEBUG_BUILD         (1)
#define MICROPY_MBOOT_MAGIC_ID      0x5AA5D0C0

// ===========================================
// Options to control how MicroPython is built
// ===========================================

#define MICROPY_HW_BOARD_NAME       CONFIG_MICROPY_HW_BOARD_NAME
#define MICROPY_HW_MCU_NAME         CONFIG_MICROPY_HW_MCU_NAME

#define MICROPY_PY_SYS_PLATFORM     "K210/FreeRTOS"
#define MICROPY_PY_LOBO_VERSION     "1.12.02"
#define MICROPY_PY_LOBO_VERSION_NUM (0x011201)

#ifdef CONFIG_MICROPY_PY_USE_LOG_COLORS
#define MICROPY_PY_USE_LOG_COLORS   (1)
#else
#define MICROPY_PY_USE_LOG_COLORS   (0)
#endif

#ifdef CONFIG_MICROPY_USE_OTA
#define MICROPY_PY_USE_OTA          (1)
#else
#define MICROPY_PY_USE_OTA          (0)
#endif

/*
   Several basic configurations can be selected for build:
   -------------------------------------------------------
   1. One MicroPython instance with PyStack enabled
   2. One MicroPython instance without PyStack enabled
   3. Two MicroPython instances with PyStack enabled
   4. Two MicroPython instances without PyStack enabled
   -------------------------------------------------------

   The following options are configurable on runtime from MicroPython:
   -------------------------------------------------------------------
   - running two MPy instances
   - using PyStack
   - heap size
   - PyStack size
   - MicroPython task(s) stack size
   - default CPU frequency
   - default REPL baudrate
   - boot menu pin
   - default log level
   - MicroPython VM divisor
   - use log colors or not
*/

//---------------------------------------------------------------------------
// If set to 1, two main MicroPython tasks are created on boot,
// each running on its own K210 processor and using the separate environments
// Various functions for inter process communications are provided
#ifdef CONFIG_MICROPY_USE_TWO_MAIN_TASKS
#define MICROPY_USE_TWO_MAIN_TASKS              (1)
#else
#define MICROPY_USE_TWO_MAIN_TASKS              (0)
#endif
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
// Whether to enable a separate allocator for the Python stack.
// If not enabled, the thread's (FreeRTOS task's) stack is used
#ifdef CONFIG_MICROPY_ENABLE_PYSTACK
#define MICROPY_ENABLE_PYSTACK                  (1)
#else
#define MICROPY_ENABLE_PYSTACK                  (1)
#endif
//---------------------------------------------------------------------------

#ifdef CONFIG_MICROPY_K210_KPU_USED
#define MICROPY_K210_KPU_USED                   (1)
#else
#define MICROPY_K210_KPU_USED                   (0)
#endif


/* ==== K210 Memory usage ======================================================================================
 * K210 has 8 MB of SRAM
 * 2MB ~ 3.5MB is reserved for firmware, static and global variables and heap used by various internal functions
 * If the KPU is used, last 2 MB are reserved for its use
 * The remaining (4.5MB ~ 6MB or 2.5MB ~ 4MB) is used for FreeRTOS heap
 *   - MicroPython heap is allocated from FreeRTOS heap
 *   - thread's (task's) stacks and all buffers are allocated from FreeRTOS heap
 *   - If two MicroPython instances are configured, the available heap space is divided between them,
 *     default values are: 5/8 for 1st MicroPython instance and 3/8 for the 2nd
 * ----------------------------------------------------------------------
 * !!! IMPORTANT !!!
 * ----------------------------------------------------------------------
 * When KPU memory is used to expand the FreeRTOS heap
 * some variables (on task stack or on FreeRTOS heap) may be placed
 * at SRAM address above 0x80600000 !
 * Those variables CAN'T be used in DMA transfers involving peripherals !
 * =============================================================================================================
*/

#define K210_SRAM_START_ADDRESS                 (0x80000000UL)
//#define K210_SRAM_START_ADDRESS_NOCACHE         (0x40000000UL)
// === Total usable K210 SRAM size, excluding the 2MB KPU SRAM
#define K210_SRAM_SIZE                          (6*1024*1024)
// ==== K210 AiSRAM size
#define K210_AISRAM_SIZE                        (2*1024*1024)
#define K210_TOTAL_SRAM_SIZE                    (K210_SRAM_SIZE+K210_AISRAM_SIZE)

/* ========================================================
 * CONFIG_FIRMWARE_SIZE_TYPE is used by the BUILD.sh script
 * to select the appropriate linker script
 * 0 - 2   MB of SRAM is used for the firmware
 * 1 - 2.5 MB of SRAM is used for the firmware
 * 2 - 3   MB of SRAM is used for the firmware
 * 3 - 3.5 MB of SRAM is used for the firmware
 * --------------------------------------------------------
 * This area contains the firmware code, defined constants,
 * and all declared variables. Remaining space is used as
 * system heap (for 'malloc' function).
 * ========================================================
 */

