loboris/MicroPython_K210_LoBo/k210-freertos/mpy_support/mpconfigport.h
/*
 * SRAM size reserved for the firmware
 * if sqlite is compiled, at least 3MB must be used
 *
 */
#if (CONFIG_FIRMWARE_SIZE_TYPE == 0)
#define FIRMWARE_SRAM_SIZE                      (0x200000UL)
#elif (CONFIG_FIRMWARE_SIZE_TYPE == 1)
#define FIRMWARE_SRAM_SIZE                      (0x280000UL)
#elif (CONFIG_FIRMWARE_SIZE_TYPE == 2)
#define FIRMWARE_SRAM_SIZE                      (0x300000UL)
#else
#define FIRMWARE_SRAM_SIZE                      (0x380000UL)
#endif

/*
 * Size of the SRAM area used for RAMBUFFER
 * variables placed in this area will be preserved after reset
 * This area i placed after end of firmware area (at 'FIRMWARE_SRAM_SIZE')
 */
#define MYCROPY_SYS_RAMBUF_SIZE                 4096
#define MICROPY_SYS_RAMBUF_ADDR                 (K210_SRAM_START_ADDRESS+FIRMWARE_SRAM_SIZE)

// === SRAM area used for FreeRTOS
#define MICRO_PY_FREE_RTOS_RESERVED             (CONFIG_MICRO_PY_FREE_RTOS_RESERVED * 1024)
#define FREE_RTOS_HEAP_START_ADDR               (MICROPY_SYS_RAMBUF_ADDR + MYCROPY_SYS_RAMBUF_SIZE)
#if MICROPY_K210_KPU_USED
#define FREE_RTOS_TOTAL_HEAP_SIZE               (K210_SRAM_SIZE - FIRMWARE_SRAM_SIZE - MYCROPY_SYS_RAMBUF_SIZE)
#else
#define FREE_RTOS_TOTAL_HEAP_SIZE               (K210_SRAM_SIZE - FIRMWARE_SRAM_SIZE - MYCROPY_SYS_RAMBUF_SIZE + K210_AISRAM_SIZE)

#endif

// === FreeRTOS heap used for MicroPython heap
#define MICRO_PY_MAX_HEAP_SIZE                  (FREE_RTOS_TOTAL_HEAP_SIZE - MICRO_PY_FREE_RTOS_RESERVED)
#define MICRO_PY_MIN_HEAP_SIZE                  (128*1024)

#if MICROPY_USE_TWO_MAIN_TASKS
#define MICROPY_HEAP_SIZE                       (MICRO_PY_MAX_HEAP_SIZE * 5 / 8)
#define MICROPY_HEAP_SIZE2                      (MICRO_PY_MAX_HEAP_SIZE * 3 / 8)
#else
#define MICROPY_HEAP_SIZE                       (MICRO_PY_MAX_HEAP_SIZE)
#define MICROPY_HEAP_SIZE2                      (0)
#endif

// === MicroPython main task stack size in bytes ===
#define MICROPY_TASK_STACK_RESERVED             (512)
#define MICROPY_TASK_STACK_SIZE                 (32 * 1024)
// === MicroPython main task stack size in stack_type units (64-bits) ===
#define MICROPY_TASK_STACK_LEN                  (MICROPY_TASK_STACK_SIZE / sizeof(StackType_t))

#define MICRO_PY_MIN_PYSTACK_SIZE               (2*1024)
#define MICRO_PY_MAX_PYSTACK_SIZE               (32*1024)
#if MICROPY_ENABLE_PYSTACK
#define MICROPY_PYSTACK_SIZE                    (4096)
#else
#define MICROPY_PYSTACK_SIZE                    (0)
#endif
// ================================================================================================================


//==================================================================
// Flash chip configuration and Flash FS selection and configuration
//==================================================================

// Flash chip size (usually 16 MB Flash)
#define MICRO_PY_FLASH_SIZE                     (CONFIG_MICRO_PY_FLASH_SIZE*1024*1024)
// Flash chip erase size
#define MICRO_PY_FLASH_ERASE_SECTOR_SIZE        (4096)

// Flash chip address where the file system starts
#define MICRO_PY_FLASHFS_START_ADDRESS          (CONFIG_MICRO_PY_FLASHFS_START_ADDRESS*1024*1024)

// Flash file system size in bytes
#if (MICRO_PY_FLASHFS_START_ADDRESS + (CONFIG_MICRO_PY_FLASHFS_SIZE*1024*1024)) > MICRO_PY_FLASH_SIZE
#define MICRO_PY_FLASHFS_SIZE                   (MICRO_PY_FLASH_SIZE - MICRO_PY_FLASHFS_START_ADDRESS)
#else
#define MICRO_PY_FLASHFS_SIZE                   (CONFIG_MICRO_PY_FLASHFS_SIZE*1024*1024)
#endif

#define MICRO_PY_FLASHFS_LITTLEFS               0
#define MICRO_PY_FLASHFS_SPIFFS                 1
// define which file system is used
#define MICRO_PY_FLASHFS_USED                   (CONFIG_MICROPY_FILESYSTEM_TYPE)

#define MICRO_PY_FLASH_CONFIG_START             (MICRO_PY_FLASHFS_START_ADDRESS + MICRO_PY_FLASHFS_SIZE + MICRO_PY_FLASH_ERASE_SECTOR_SIZE*2)
#define MICRO_PY_FLASH_CONFIG_SIZE              (4096)

#define MICRO_PY_FLASH_USER_VAR_START           (MICRO_PY_FLASH_CONFIG_START + MICRO_PY_FLASH_CONFIG_SIZE)
#define MICRO_PY_FLASH_USER_VAR_SIZE            (16*1024)

#define MICRO_PY_FLASH_USED_END                 (MICRO_PY_FLASH_USER_VAR_START + MICRO_PY_FLASH_USER_VAR_SIZE)

#if (MICRO_PY_FLASH_USED_END > MICRO_PY_FLASH_SIZE)
#error "Misconfigured Flash sizes"
#endif

// -------------------------
// File system configuration
// -------------------------
#if MICRO_PY_FLASHFS_USED == MICRO_PY_FLASHFS_SPIFFS
#define MICRO_PY_SPIFFS_LOG_BLOCK_SIZE          (4*1024)
#define MICROPY_VFS_SPIFFS                      (1)
#define mp_type_fileio                          mp_type_vfs_spiffs_fileio
#define mp_type_textio                          mp_type_vfs_spiffs_textio
#else
#define MICROPY_VFS_SPIFFS                      (0)
#endif

#if MICRO_PY_FLASHFS_USED == MICRO_PY_FLASHFS_LITTLEFS
#define MICRO_PY_LITTLEFS_SECTOR_SIZE           (512)
#define MICRO_PY_LITTLEFS_RWBLOCK_SIZE          (512)
#define MICROPY_VFS_LITTLEFS                    (1)
#define mp_type_fileio                          mp_type_vfs_littlefs_fileio
#define mp_type_textio                          mp_type_vfs_littlefs_textio
#else
#define MICROPY_VFS_LITTLEFS                    (0)
#endif
//==================================================================

//---------------------------------------------------------------------
// === In this MicroPython port threads are always supported! ===
#define MICROPY_PY_THREAD                       (1)  // !DO NOT CHANGE!
#define MICROPY_PY_THREAD_GIL                   (1)  // !DO NOT CHANGE!
// How many bytecodes are executed before the threads are switched
#define MICROPY_PY_THREAD_GIL_VM_DIVISOR        (CONFIG_MICROPY_PY_THREAD_GIL_VM_DIVISOR)
//---------------------------------------------------------------------

#define MICRO_PY_DEFAULT_CPU_CLOCK              (400000000)                        // default cpu clock in Hz
#define MICRO_PY_DEFAULT_BAUDRATE               (CONFIG_MICRO_PY_DEFAULT_BAUDRATE) // default REPL baudrate

#define MICRO_PY_BOOT_MENU_PIN                  (CONFIG_MICRO_PY_BOOT_MENU_PIN)

#define MICRO_PY_ALLOW_OVERCLOCK                (0)
#if MICRO_PY_ALLOW_OVERCLOCK
#define MICRO_PY_CPU_MAX_FREQ                   (750)
#else
#define MICRO_PY_CPU_MAX_FREQ                   (500)
#endif

#define USE_MICROPY_VM_HOOK_LOOP                (1)
#if USE_MICROPY_VM_HOOK_LOOP
extern void vm_loop_hook();
#define MICROPY_VM_HOOK_LOOP                    vm_loop_hook();
#endif

// === stack entries are 64-bit, stack size in bytes is 8*MICROPY_THREAD_STACK_SIZE ===
#define MICROPY_THREAD_STACK_SIZE               (2048) // default thread stack size in STACK UNITS (8 bytes)
#define MICROPY_TASK_PRIORITY                   (8)    // default thread priority

