loboris/MicroPython_K210_LoBo/k210-freertos/mpy_support/mpconfigport.h
// === Buffer size for UART used as RELP standard input/output ===
#define MICRO_PY_UARTHS_BUFFER_SIZE             (1280)

// object representation and NLR handling

//-----------------------------------------------------------------------------
// A MicroPython object is a machine word having the following form (called R):
// On K210, all objects are 64-bit values !
// ---------------------------------------------------------------------------------------------------------------------
//  - iiiiiiii iiiiiiii iiiiiiii iiiiiiii iiiiiiii iiiiiiii iiiiiiii iiiiiii1  : Integer with 63-bit signed value
//  - 00000000 00000000 00000000 00000000 01111111 1qqqqqqq qqqqqqqq qqqqq110  : str with 20-bit qstr value
//  - s1111111 10000000 00000000 00000000 00000000 00000000 00000000 00000010  : +/- inf, x == 0
//  - s1111111 1xxxxxxx xxxxxxxx xxxxxxxx xxxxxxxx xxxxxxxx xxxxxxxx xxxxx010  : nan, x != 0
//  - seeeeeee efffffff ffffffff ffffffff ffffffff ffffffff ffffffff ffffff10  : 52-bit float, 8-bit exponent; e != 0xff
//  - 00000000 00000000 00000000 00000000 pppppppp pppppppp pppppppp pppppp00  : ptr (4 byte alignment)
// ---------------------------------------------------------------------------------------------------------------------
// Floats are stored as O = R + 0x80800000, retrieved as R = O - 0x80800000.
//   - 0x80800000 constant is added to distinguish the float from Qstr
// Qstr values are 20 bits, stored as O = (R << 3) | 6, retrieved as R = O >> 3
// Floats and Qstr-s have 2 least significant bits '10' to make sure they don't look like pointers to the garbage collector.
// Integers (63-bit) have 1 as LSB to make sure they don't look like pointers to the garbage collector.
// Pointers are 4 byte aligned and are the only objects that have 2 least significant bits '00'

#define MICROPY_OBJ_REPR                        (MICROPY_OBJ_REPR_C)  // !DO NOT CHANGE!
#define MICROPY_OBJ_REPR_C64                    (1)                   // !DO NOT CHANGE!
//--------------------------------------------------------------------------------------------------

#define MICROPY_VFS                             (1)  // !DO NOT CHANGE!

#define MICROPY_VFS_SDCARD                      (1)
// Vfs_FAT is not used!
#define MICROPY_VFS_FAT                         (0) // !do not change!
#define MICROPY_FATFS_REENTRANT                 (1)

// === Those two defines must be commented/uncommented
// === not only set to 0 if not used !
#define MICROPY_NLR_SETJMP                      (1)
//#define MICROPY_DEBUG_NLR                       (1)

#define MICROPY_READER_VFS                      (1)

// Whether to provide "sys.getsizeof" function
#define MICROPY_PY_SYS_GETSIZEOF                (0)

// MCU definition, do not change
#define MP_ENDIANNESS_LITTLE                    (1)
#define MICROPY_NO_ALLOCA                       (0)
#define MICROPY_OBJ_BASE_ALIGNMENT              __attribute__((aligned(8)))

// optimizations
#define MICROPY_OPT_CACHE_MAP_LOOKUP_IN_BYTECODE    (0)

#define MICROPY_OPT_COMPUTED_GOTO               (1)
#define MICROPY_OPT_MPZ_BITWISE                 (1)

#define MICROPY_USE_INTERNAL_PRINTF             (1)

#define MICROPY_ENABLE_COMPILER                 (1)

#define MICROPY_QSTR_BYTES_IN_HASH              (1)
#define MICROPY_ALLOC_PATH_MAX                  (128)
#define MICROPY_ALLOC_PARSE_CHUNK_INIT          (16)

#define MICROPY_DYNAMIC_COMPILER                (0)
#define MICROPY_EMIT_X64                        (0)
#define MICROPY_EMIT_X86                        (0)
#define MICROPY_EMIT_ARM                        (0)
#define MICROPY_EMIT_THUMB                      (0)
#define MICROPY_EMIT_INLINE_THUMB               (0)
#define MICROPY_EMIT_INLINE_THUMB_ARMV7M        (0)
#define MICROPY_EMIT_XTENSA                     (0)
#define MICROPY_EMIT_INLINE_XTENSA              (0)

#define MICROPY_COMP_MODULE_CONST               (1)
#define MICROPY_COMP_CONST                      (1)
#define MICROPY_COMP_DOUBLE_TUPLE_ASSIGN        (1)
#define MICROPY_COMP_TRIPLE_TUPLE_ASSIGN        (1)

#define MICROPY_ENABLE_SCHEDULER                (1)
#define MICROPY_SCHEDULER_DEPTH                 (8)

#define MICROPY_ENABLE_FINALISER                (1)
#define MICROPY_STACK_CHECK                     (1) // !do not change!
#define MICROPY_ENABLE_EMERGENCY_EXCEPTION_BUF  (1)
#define MICROPY_KBD_EXCEPTION                   (1)
#define MICROPY_REPL_EMACS_KEYS                 (1)
#define MICROPY_REPL_AUTO_INDENT                (1)
#define MICROPY_HAL_HAS_VT100                   (1)

#define MICROPY_CPYTHON_COMPAT                  (1)
#define MICROPY_STREAMS_NON_BLOCK               (1)
#define MICROPY_STREAMS_POSIX_API               (1)
#define MICROPY_MODULE_BUILTIN_INIT             (1)
#define MICROPY_MODULE_WEAK_LINKS               (1)

#define MICROPY_PERSISTENT_CODE_LOAD            (1)
#define MICROPY_PERSISTENT_CODE_SAVE            (0)

#define MICROPY_COMP_RETURN_IF_EXPR             (1)

#define MICROPY_PY_COLLECTIONS                  (1)
#define MICROPY_PY_COLLECTIONS_DEQUE            (1)
#define MICROPY_PY_COLLECTIONS_ORDEREDDICT      (1)

extern const struct _mp_print_t mp_debug_print;
#define MICROPY_DEBUG_VERBOSE                   (0)
#define MICROPY_DEBUG_PRINTER                   (&mp_debug_print)

#define MICROPY_MEM_STATS                       (0)
#define MICROPY_DEBUG_PRINTERS                  (0)
#define MICROPY_ENABLE_GC                       (1) // !do not change!
#define MICROPY_GC_ALLOC_THRESHOLD              (1) // !do not change!
#define MICROPY_REPL_EVENT_DRIVEN               (0)
#define MICROPY_MALLOC_USES_ALLOCATED_SIZE      (0)
#define MICROPY_HELPER_REPL                     (1)
#define MICROPY_HELPER_LEXER_UNIX               (1)
#define MICROPY_ENABLE_SOURCE_LINE              (1)
#define MICROPY_ENABLE_DOC_STRING               (0)
#define MICROPY_ERROR_REPORTING                 (MICROPY_ERROR_REPORTING_TERSE)

#define MICROPY_MODULE_GETATTR                  (1)

#define MICROPY_BUILTIN_METHOD_CHECK_SELF_ARG   (0)
#define MICROPY_PY_ASYNC_AWAIT                  (0)

#define MICROPY_PY_BUILTINS_BYTEARRAY           (1)
#define MICROPY_PY_BUILTINS_MEMORYVIEW          (1)
#define MICROPY_PY_BUILTINS_FROZENSET           (1)
#define MICROPY_PY_BUILTINS_SET                 (1)
#define MICROPY_PY_BUILTINS_PROPERTY            (1)
#define MICROPY_PY_BUILTINS_MIN_MAX             (1)
#define MICROPY_PY_BUILTINS_STR_OP_MODULO       (1)
#define MICROPY_PY_GC                           (1)
#define MICROPY_MODULE_FROZEN_STR               (0)
#define MICROPY_MODULE_FROZEN_MPY               (1)
#define MICROPY_LONGINT_IMPL                    (MICROPY_LONGINT_IMPL_MPZ) //(MICROPY_LONGINT_IMPL_LONGLONG)

//-----------------------------
// control over Python builtins
//-----------------------------
// Strings this length or less will be interned by the parser
#define MICROPY_ALLOC_PARSE_INTERN_STRING_LEN   (64)
#define MICROPY_ALLOC_QSTR_CHUNK_INIT           (256)

#define MICROPY_FLOAT_IMPL                      (MICROPY_FLOAT_IMPL_DOUBLE)
#define MICROPY_PY_BUILTINS_HELP                (1)
#define MICROPY_PY_BUILTINS_HELP_TEXT           kendryte_k210_help_text
#define MICROPY_PY_BUILTINS_HELP_MODULES        (1)
#define MICROPY_PY_BUILTINS_COMPLEX             (1)
#define MICROPY_PY_BUILTINS_FLOAT               (1)

#define MICROPY_PY_STR_BYTES_CMP_WARN           (1)
#define MICROPY_PY_BUILTINS_STR_UNICODE         (1)
#define MICROPY_PY_BUILTINS_STR_CENTER          (1)
#define MICROPY_PY_BUILTINS_STR_PARTITION       (1)
#define MICROPY_PY_BUILTINS_STR_SPLITLINES      (1)
#define MICROPY_PY_BUILTINS_SLICE               (1)
#define MICROPY_PY_BUILTINS_SLICE_ATTRS         (1)
#define MICROPY_PY_BUILTINS_SLICE_INDICES       (1)
#define MICROPY_PY_BUILTINS_RANGE_ATTRS         (1)
#define MICROPY_PY_BUILTINS_ROUND_INT           (1)
#define MICROPY_PY_BUILTINS_TIMEOUTERROR        (1)
#define MICROPY_PY_ALL_SPECIAL_METHODS          (1)
#define MICROPY_PY_BUILTINS_COMPILE             (1)
#define MICROPY_PY_BUILTINS_ENUMERATE           (1)
#define MICROPY_PY_BUILTINS_EXECFILE            (1)
#define MICROPY_PY_BUILTINS_FILTER              (1)
#define MICROPY_PY_BUILTINS_REVERSED            (1)
#define MICROPY_PY_BUILTINS_NOTIMPLEMENTED      (1)
#define MICROPY_PY_BUILTINS_INPUT               (1)
#define MICROPY_PY_BUILTINS_POW3                (1)
#define MICROPY_PY___FILE__                     (1)
#define MICROPY_PY_MICROPYTHON_MEM_INFO         (1)
#define MICROPY_PY_ARRAY                        (1)
#define MICROPY_PY_ARRAY_SLICE_ASSIGN           (1)
#define MICROPY_PY_MATH                         (1)
#define MICROPY_PY_MATH_SPECIAL_FUNCTIONS       (1)
#define MICROPY_PY_CMATH                        (1)
#define MICROPY_PY_IO                           (1)
#define MICROPY_PY_IO_IOBASE                    (1)
#define MICROPY_PY_IO_FILEIO                    (1)
#define MICROPY_PY_IO_BYTESIO                   (1)
#define MICROPY_PY_IO_BUFFEREDWRITER            (1)
#define MICROPY_PY_STRUCT                       (1)
#define MICROPY_PY_SYS                          (1)
#define MICROPY_PY_SYS_MAXSIZE                  (1)
#define MICROPY_PY_SYS_MODULES                  (1)
#define MICROPY_PY_SYS_EXIT                     (1)
#define MICROPY_PY_SYS_STDFILES                 (1)
#define MICROPY_PY_SYS_STDIO_BUFFER             (1)
#define MICROPY_PY_UERRNO                       (1)
#define MICROPY_PY_USELECT                      (1)
#define MICROPY_PY_UTIME_MP_HAL                 (1)

//#define MP_SSIZE_MAX                            (0x7fffffff)
#define MP_SSIZE_MAX                            (0x7fffffffffffffff)

#define                                         _USE_MKFS 1
#define                                         _FS_READONLY 0

