loboris/MicroPython_K210_LoBo/k210-freertos/mpy_support/mpconfigport.h
// use vfs's functions for import stat and builtin open
#define mp_import_stat mp_vfs_import_stat
#define mp_builtin_open mp_vfs_open
#define mp_builtin_open_obj mp_vfs_open_obj
#define MICROPY_PY_ATTRTUPLE                    (1)

#define MICROPY_PY_FUNCTION_ATTRS               (1)
#define MICROPY_PY_DESCRIPTORS                  (1)

//=================
// Extended modules
//=================

// used only for testing, should not be included in releases
#define MICROPY_PY_USE_TEST_MODULE              (0)

// -----------------------------------------------------
// sqlite3 module uses ~416 KB of code (and SRAM) space!
// and requires 3MB firmware size
// -----------------------------------------------------
#if (CONFIG_FIRMWARE_SIZE_TYPE >= 2)
#ifdef CONFIG_MICROPY_PY_USE_SQLITE
#define MICROPY_PY_USE_SQLITE                   (1)
#else
#define MICROPY_PY_USE_SQLITE                   (0)
#endif
#else
#define MICROPY_PY_USE_SQLITE                   (0)
#endif

#ifdef CONFIG_MICROPY_PY_USE_GSM
#define MICROPY_PY_USE_GSM                      (1)
#else
#define MICROPY_PY_USE_GSM                      (0)
#endif
#ifdef CONFIG_MICROPY_PY_USE_WIFI
#define MICROPY_PY_USE_WIFI                     (1)
#else
#define MICROPY_PY_USE_WIFI                     (0)
#endif
#ifdef CONFIG_MICROPY_PY_USE_ESP32
#define MICROPY_PY_USE_ESP32                    (1)
#else
#define MICROPY_PY_USE_ESP32                    (0)
#endif

#if (MICROPY_PY_USE_WIFI == 1) || (MICROPY_PY_USE_GSM == 1)
#define MICROPY_PY_USE_NETTWORK                 (1)
#else
#define MICROPY_PY_USE_NETTWORK                 (0)
#endif

#if MICROPY_PY_USE_NETTWORK
#ifdef CONFIG_MICROPY_PY_USE_MQTT
#define MICROPY_PY_USE_MQTT                     (1)
#else
#define MICROPY_PY_USE_MQTT                     (0)
#endif
#ifdef CONFIG_MICROPY_PY_USE_REQUESTS
#define MICROPY_PY_USE_REQUESTS                 (1)
#else
#define MICROPY_PY_USE_REQUESTS                 (0)
#endif
#endif

#ifdef CONFIG_MICROPY_USE_DISPLAY
#define MICROPY_USE_DISPLAY                     (1)
#else
#define MICROPY_USE_DISPLAY                     (0)
#endif
#ifdef CONFIG_MICROPY_USE_TFT
#define MICROPY_USE_TFT                         (1)
#else
#define MICROPY_USE_TFT                         (0)
#endif
#ifdef CONFIG_MICROPY_USE_EPD
#define MICROPY_USE_EPD                         (1)
#else
#define MICROPY_USE_EPD                         (0)
#endif
#ifdef CONFIG_MICROPY_USE_CAMERA
#define MICROPY_USE_CAMERA                      (1)
#else
#define MICROPY_USE_CAMERA                      (0)
#endif

#ifdef CONFIG_MICROPY_PY_USE_ULAB
#define MODULE_ULAB_ENABLED                     (1)
#else
#define MODULE_ULAB_ENABLED                     (0)
#endif

#define MICROPY_PY_UCTYPES                      (1)
#define MICROPY_PY_UZLIB                        (1)
#define MICROPY_PY_UJSON                        (1)
#define MICROPY_PY_URE                          (1)
#define MICROPY_PY_URE_SUB                      (1)
#define MICROPY_PY_UHEAPQ                       (1)
#define MICROPY_PY_UTIMEQ                       (0) // !do not change!
#define MICROPY_PY_UTIMEQ_K210                  (1) // !do not change!

// MicroPython implementation of hash/crypto functions is not used!
#define MICROPY_PY_UHASHLIB                     (0) // !do not change!
#define MICROPY_PY_UHASHLIB_MD5                 (0) // !do not change!
#define MICROPY_PY_UHASHLIB_SHA1                (0) // !do not change!
#define MICROPY_PY_UHASHLIB_SHA256              (0) // !do not change!
#define MICROPY_PY_UCRYPTOLIB                   (0) // !do not change!
// K210 specific implementation of hash/crypto functions, do not disable !
#define MICROPY_PY_UHASHLIB_K210                (1)
#define MICROPY_PY_UHASHLIB_MD5_K210            (1)
#define MICROPY_PY_UHASHLIB_SHA1_K210           (1)
#define MICROPY_PY_UHASHLIB_SHA256_K210         (1)
#define MICROPY_PY_UCRYPTOLIB_K210              (1)

#define MICROPY_PY_UBINASCII                    (1)
#define MICROPY_PY_UBINASCII_CRC32              (1)
#define MICROPY_PY_URANDOM                      (1)
#define MICROPY_PY_URANDOM_EXTRA_FUNCS          (1)
#define MICROPY_PY_OS_DUPTERM                   (0)

#define MICROPY_PY_MACHINE_PULSE                (1) // !do not change
#define MICROPY_PY_MACHINE_I2C                  (0) // !do not change

#define MICROPY_PY_MACHINE_SPI                  (0) // !do not change
#define MICROPY_PY_MACHINE_SPI_MSB              (0)
#define MICROPY_PY_MACHINE_SPI_LSB              (1)
#define MICROPY_PY_MACHINE_SPI_MAKE_NEW         machine_hw_spi_make_new
#define MICROPY_HW_SOFTSPI_MIN_DELAY            (0)
#define MICROPY_HW_SOFTSPI_MAX_BAUDRATE         (sysctl_clock_get_freq(SYSCTL_CLOCK_CPU) / 100) // roughly

#define MICROPY_PY_USSL                         (1)
#define MICROPY_SSL_MBEDTLS                     (1)
#define MICROPY_PY_USSL_FINALISER               (0)
#define MICROPY_PY_WEBSOCKET                    (1)
#define MICROPY_PY_WEBREPL                      (0) // !do not change
#define MICROPY_PY_FRAMEBUF                     (1)
#define MICROPY_PY_USOCKET_EVENTS               (MICROPY_PY_WEBREPL)

// disable ext str pool
#define MICROPY_QSTR_EXTRA_POOL                 mp_qstr_frozen_const_pool

// type definitions for the specific machine

#define MICROPY_MAKE_POINTER_CALLABLE(p) ((void*)((mp_uint_t)(p) | 1))

#if MICROPY_PY_USOCKET_EVENTS
#define MICROPY_PY_USOCKET_EVENTS_HANDLER extern void usocket_events_handler(void); usocket_events_handler();
#else
#define MICROPY_PY_USOCKET_EVENTS_HANDLER
#endif

#if MICROPY_PY_THREAD
#define MICROPY_EVENT_POLL_HOOK \
    do { \
        extern void mp_handle_pending(void); \
        mp_handle_pending(); \
        MICROPY_PY_USOCKET_EVENTS_HANDLER \
        MP_THREAD_GIL_EXIT(); \
        MP_THREAD_GIL_ENTER(); \
    } while (0);
#else
#define MICROPY_EVENT_POLL_HOOK \
    do { \
        extern void mp_handle_pending(void); \
        mp_handle_pending(); \
        MICROPY_PY_USOCKET_EVENTS_HANDLER \
        asm("waiti 0"); \
    } while (0);
#endif

