loboris/MicroPython_K210_LoBo/k210-freertos/mpy_support/mpconfigport.h
// This port is 64-bit
// This requires appropriate printf formatting specifiers
#define UINT_FMT "%lu"
#define INT_FMT "%ld"

typedef int64_t mp_int_t;   // must be pointer size
typedef uint64_t mp_uint_t; // must be pointer size
typedef int64_t mp_off_t;

#define MP_PLAT_PRINT_STRN(str, len) mp_hal_stdout_tx_strn_cooked(str, len)

// extra built in names to add to the global namespace
#define MICROPY_PORT_BUILTINS \
    { MP_ROM_QSTR(MP_QSTR_open), MP_ROM_PTR(&mp_builtin_open_obj) },

// ==== Include extra modules into build ===================================
extern const struct _mp_obj_module_t machine_module;
extern const struct _mp_obj_module_t uos_module;
extern const struct _mp_obj_module_t utime_module;
extern const struct _mp_obj_module_t mp_module_ymodem;

#if MICROPY_PY_USE_NETTWORK
extern const struct _mp_obj_module_t mp_module_network;
#define BUILTIN_MODULE_NETWORK { MP_ROM_QSTR(MP_QSTR_network),     MP_ROM_PTR(&mp_module_network) },
#else
#define BUILTIN_MODULE_NETWORK
#endif

#if MICROPY_PY_USE_NETTWORK
extern const struct _mp_obj_module_t mp_module_usocket;
#define BUILTIN_MODULE_SOCKET { MP_OBJ_NEW_QSTR(MP_QSTR_usocket),     (mp_obj_t)&mp_module_usocket }, { MP_OBJ_NEW_QSTR(MP_QSTR_socket),      (mp_obj_t)&mp_module_usocket },
#else
#define BUILTIN_MODULE_SOCKET
#endif

#if MICROPY_PY_UHASHLIB_K210
extern const struct _mp_obj_module_t mp_module_uhashlib;
#define BUILTIN_MODULE_UHASHLIB_K210 { MP_ROM_QSTR(MP_QSTR_uhashlib), MP_ROM_PTR(&mp_module_uhashlib) },
#else
#define BUILTIN_MODULE_UHASHLIB_K210
#endif

#if MICROPY_PY_UCRYPTOLIB_K210
extern const struct _mp_obj_module_t mp_module_ucryptolib;
#define BUILTIN_MODULE_UCRYPTOLIB_K210 { MP_ROM_QSTR(MP_QSTR_ucryptolib), MP_ROM_PTR(&mp_module_ucryptolib) },
#else
#define BUILTIN_MODULE_UCRYPTOLIB_K210
#endif

#if MICROPY_USE_DISPLAY
extern const struct _mp_obj_module_t mp_module_display;
#define BUILTIN_MODULE_DISPLAY { MP_OBJ_NEW_QSTR(MP_QSTR_display), (mp_obj_t)&mp_module_display },
#else
#define BUILTIN_MODULE_DISPLAY
#endif

#if MICROPY_USE_CAMERA
extern const struct _mp_obj_module_t mp_module_camera;
#define BUILTIN_MODULE_CAMERA { MP_OBJ_NEW_QSTR(MP_QSTR_camera), (mp_obj_t)&mp_module_camera },
#else
#define BUILTIN_MODULE_CAMERA
#endif

#if MICROPY_PY_UTIMEQ_K210
extern const struct _mp_obj_module_t mp_module_utimeq;
#define BUILTIN_MODULE_UTIMEQ_K210 { MP_OBJ_NEW_QSTR(MP_QSTR_utimeq), (mp_obj_t)&mp_module_utimeq },
#else
#define BUILTIN_MODULE_UTIMEQ_K210
#endif

#if MICROPY_PY_USE_SQLITE
extern const struct _mp_obj_module_t mp_module_usqlite3;
#define BUILTIN_MODULE_SQLITE { MP_OBJ_NEW_QSTR(MP_QSTR_usqlite3), (mp_obj_t)&mp_module_usqlite3 },
#else
#define BUILTIN_MODULE_SQLITE
#endif

#if MICROPY_PY_USE_TEST_MODULE
extern const struct _mp_obj_module_t mp_test_module;
#define BUILTIN_MODULE_TEST { MP_OBJ_NEW_QSTR(MP_QSTR_test), (mp_obj_t)&mp_test_module },
#else
#define BUILTIN_MODULE_TEST
#endif

#if MICROPY_PY_USE_OTA
extern const struct _mp_obj_module_t ota_module;
#define BUILTIN_MODULE_OTA { MP_OBJ_NEW_QSTR(MP_QSTR_ota), (mp_obj_t)&ota_module },
#else
#define BUILTIN_MODULE_OTA
#endif

#define MICROPY_PORT_BUILTIN_MODULES \
    { MP_OBJ_NEW_QSTR(MP_QSTR_os),          (mp_obj_t)&uos_module }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_time),        (mp_obj_t)&utime_module }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_re),          (mp_obj_t)&mp_module_ure }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_json),        (mp_obj_t)&mp_module_ujson }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_io),          (mp_obj_t)&mp_module_io }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_binascii),    (mp_obj_t)&mp_module_ubinascii }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_collections), (mp_obj_t)&mp_module_collections }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_uos),         (mp_obj_t)&uos_module }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_utime),       (mp_obj_t)&utime_module }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_machine),     (mp_obj_t)&machine_module }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_ymodem),      (mp_obj_t)&mp_module_ymodem }, \
    BUILTIN_MODULE_NETWORK \
    BUILTIN_MODULE_SOCKET \
    BUILTIN_MODULE_UHASHLIB_K210 \
    BUILTIN_MODULE_UCRYPTOLIB_K210 \
    BUILTIN_MODULE_DISPLAY \
    BUILTIN_MODULE_CAMERA \
    BUILTIN_MODULE_UTIMEQ_K210 \
    BUILTIN_MODULE_SQLITE \
    BUILTIN_MODULE_TEST \
    BUILTIN_MODULE_OTA \

/*
#define MICROPY_PORT_BUILTIN_MODULE_WEAK_LINKS \
    { MP_OBJ_NEW_QSTR(MP_QSTR_os),          (mp_obj_t)&uos_module }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_time),        (mp_obj_t)&utime_module }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_re),          (mp_obj_t)&mp_module_ure }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_io),          (mp_obj_t)&mp_module_io }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_binascii),    (mp_obj_t)&mp_module_ubinascii }, \
    { MP_OBJ_NEW_QSTR(MP_QSTR_collections), (mp_obj_t)&mp_module_collections }, \
*/

#define MICROPY_PY_MACHINE                  (1)
#define MICROPY_PY_MACHINE_PIN_MAKE_NEW     mp_pin_make_new

#define MP_STATE_PORT MP_STATE_VM

#define MICROPY_PORT_ROOT_POINTERS \
    const char *readline_hist[32];

#endif
